Autodesk.Revit.DB.Viewport.GetProjectionToSheetTransform
Returns the transform from the view's projection space to the sheet space.
Remarks:
This transform accounts for the position and rotation of a
viewport on a sheet.
Returns:
The transform from the view's projection space to the sheet space.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The viewport is not on a sheet.
-or-
The viewport does not have transforms.
Since:
2020.1

Autodesk.Revit.DB.Viewport.HasViewportTransforms
Indicates if the viewport has transforms.
Remarks:
Not all viewports have transforms.  For example,
viewports for schedules and legends do not have transforms.
Returns:
True if the viewport has transforms, false otherwise.
Since:
2020.1